{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "RAG Model 2 - Advanced RAG - Knowledge Graphs\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Initialisation\n",
    "Basic API keys\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "#open ai api key:\n",
    "key = os.environ[\"OPENAI_3_5_KEY\"] #Create a free openai 3.5 turbo key\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Initialise Azure\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CreateEmbeddingResponse(data=[Embedding(embedding=[0.0023481971584260464, -0.00928489863872528, 0.015701189637184143, -0.007710971869528294, -0.0047217803075909615, 0.014863453805446625, -0.009849735535681248, -0.038281962275505066, -0.006930354982614517, -0.028660697862505913, 0.025182828307151794, 0.018112851306796074, -0.0036047999747097492, -0.025576310232281685, 0.000499785237479955, -0.01636122167110443, 0.02827990986406803, 0.005350081715732813, 0.009652994573116302, -0.0163866076618433, -0.015396557748317719, 0.004258487373590469, 0.007006512489169836, -0.007241332437843084, -0.0038491394370794296, 0.018506333231925964, 0.00870736874639988, -0.02268231473863125, 0.011474433355033398, 0.023926224559545517, 0.015625031664967537, -0.0034905634820461273, -0.03493101894855499, -0.004160116892307997, -0.026147492229938507, -0.021539948880672455, -0.005632500164210796, 0.011785411275923252, 0.008453509770333767, 0.004122037906199694, 0.01920444518327713, -0.014444585889577866, 0.008973920717835426, 0.006378211081027985, -0.04569464921951294, 0.017846299335360527, -0.0055595156736671925, -0.0007175487698987126, -0.022136518731713295, -0.0038999111857265234, 0.02103223092854023, -0.01757974736392498, -0.011702907271683216, -0.02264423668384552, 0.01636122167110443, 0.01719895750284195, -0.008409084752202034, 0.0016405647620558739, 0.025132056325674057, -0.024967048317193985, 0.007825208827853203, 0.005778469145298004, -0.022161904722452164, 0.002909860573709011, -0.006127525120973587, -0.025538230314850807, -0.008079067803919315, 0.0010011570993810892, 0.00018355206702835858, 0.004629756323993206, 0.02080375701189041, 0.01345453504472971, 0.004661488812416792, -0.015916969627141953, 0.01655161753296852, -0.008942188695073128, -0.007565002888441086, 0.013683008030056953, -0.006993819493800402, 0.0052961367182433605, 0.009875121526420116, -0.04594850540161133, 0.003078042296692729, 0.024002382531762123, 0.0230250246822834, 0.0069747804664075375, -0.023583514615893364, 0.00992589257657528, -0.006505141034722328, -0.03330632299184799, -0.0026798006147146225, 0.019927943125367165, 0.0017103760037571192, 0.0010408225934952497, -0.022733086720108986, 0.004969292785972357, 0.015421943739056587, 0.03158007934689522, -0.005445278715342283, -0.01596774160861969, -0.0051469942554831505, 0.019953329116106033, -0.009373749606311321, -0.0061782971024513245, -0.031199289485812187, -0.009456253610551357, -0.01525693479925394, -0.028813013806939125, 0.0209941528737545, -0.018341323360800743, -0.0029336598236113787, 0.01275642216205597, 0.0050962227396667, -0.04957869276404381, -0.042978353798389435, -0.00038574691279791296, 0.021590720862150192, -0.016881633549928665, 0.0066003380343317986, -0.041531357914209366, 0.000899613369256258, 0.033484023064374924, 0.012972203083336353, -0.010541501455008984, -0.0005358807975426316, 0.018341323360800743, 9.177603351417929e-05, -0.013137211091816425, 0.011950419284403324, 0.0057911621406674385, 0.007038244977593422, 0.008656596764922142, 0.018455561250448227, -0.0008504281868226826, -0.01917905919253826, 0.021908044815063477, -0.029752293601632118, -0.0042680068872869015, 0.0014985622838139534, -0.005169207230210304, 0.01497768983244896, 0.021387632936239243, -0.01877288520336151, 0.011074605397880077, -0.007476151920855045, 0.02263154275715351, 0.019140981137752533, 0.014964996837079525, -0.003687304211780429, 0.006324266083538532, 0.025715932250022888, -0.027746805921196938, 0.036682646721601486, -0.004433015361428261, 0.0138480169698596, 0.008034641854465008, -0.005673752166330814, 0.010351107455790043, -0.005813374649733305, -0.008732754737138748, 0.010643045417964458, -4.293789606890641e-05, 0.03213856741786003, -0.02382468245923519, -0.0026274423580616713, 0.03031078353524208, 0.029625363647937775, 0.01660238951444626, 0.0021387634333223104, 0.0010305094765499234, -0.01162674929946661, 0.018468253314495087, -0.007571349386125803, 0.007387301418930292, -0.0010828679660335183, 0.0044171493500471115, 0.010033783502876759, -0.007526923902332783, -0.006200510077178478, -0.005727697163820267, -0.0283052958548069, 0.004315605852752924, 0.02934611774981022, 0.024776654317975044, -0.015713881701231003, -0.01821439526975155, 0.007507884409278631, 0.008574092760682106, -0.01172194629907608, -0.006400424055755138, 0.002032459946349263, 0.03693650662899017, -0.002373583149164915, -0.02079106494784355, -0.688872218132019, -0.019572541117668152, 0.0035159492399543524, 0.006733614020049572, 0.02833068184554577, 0.023393120616674423, 0.007146135438233614, 0.010630352422595024, 0.009570490568876266, -0.009424521587789059, -0.021298782899975777, 3.103824928984977e-05, 0.01982639916241169, 0.0022704529110342264, -0.009608568623661995, -0.0020848182030022144, -0.00038515194319188595, 0.006593991536647081, -0.041328269988298416, 0.01120788138359785, -0.013403763063251972, 0.027772191911935806, -0.011398276314139366, 0.0001931709557538852, 0.015472715720534325, -0.0005541269201785326, 0.014495357871055603, -0.008523320779204369, -0.018887121230363846, -0.017744755372405052, -0.00939913559705019, 0.024560872465372086, 0.012953163124620914, -0.00898026768118143, 0.03490563482046127, -0.0050962227396667, -0.024205470457673073, 0.024015076458454132, -0.0037951944395899773, 0.031021589413285255, -0.015015768818557262, -0.02329157665371895, 0.030234625563025475, 0.006911315489560366, 0.010078208521008492, 0.011455394327640533, 0.03033616952598095, 0.01763051748275757, 0.002105444436892867, -0.006727267522364855, 0.009729152545332909, 0.016665853559970856, 0.003655571723356843, 0.027949893847107887, 0.00399828189983964, 0.0031081880442798138, 0.02990460768342018, -0.016894327476620674, 0.0021324169356375933, 0.02325349859893322, 0.011798104271292686, 0.01426688488572836, -0.01981370709836483, -0.029599977657198906, -0.0015826531453058124, 0.01839209534227848, -0.0027385056018829346, 0.019356761127710342, 0.027569103986024857, -0.00849158875644207, 0.01232486218214035, 0.0028178365901112556, -0.005232671741396189, 0.00641946354880929, 0.009329323656857014, 0.02263154275715351, 0.023558130487799644, 0.0010551020968705416, 0.018925199285149574, -0.0029479393269866705, -0.006841504015028477, -0.010186098515987396, -0.007914058864116669, -0.00732383644208312, 0.020524512976408005, 0.010884211398661137, -0.02992999367415905, -0.003804714186117053, 0.0027765845879912376, -0.01897597126662731, 0.02992999367415905, 0.024560872465372086, -0.0044996533542871475, 0.026375966146588326, 0.01756705343723297, 0.04120134189724922, -0.02021988108754158, 0.014622286893427372, 0.021565334871411324, -0.02990460768342018, -0.0014573101652786136, 0.0034810437355190516, 0.03414405509829521, 0.03614954277873039, 0.02810220792889595, 0.018455561250448227, 0.003404885996133089, 0.009386442601680756, 0.020765678957104683, -0.012585067190229893, 0.017072027549147606, 0.011550591327250004, -0.007704625371843576, 0.01332760602235794, -0.0074380734004080296, -0.022504614666104317, 0.005902225151658058, 0.025754012167453766, -0.019115595147013664, -0.01898866519331932, -0.013340299017727375, -0.002609989373013377, 0.022517306730151176, -0.007945791818201542, -0.0008075894438661635, 0.028152979910373688, 0.014000331982970238, -0.02000410109758377, -0.021159160882234573, -0.0029273133259266615, 0.013416456058621407, 0.016094669699668884, 0.01192503422498703, -0.016818169504404068, 0.004855056293308735, -0.013048360124230385, 0.025779396295547485, -0.03033616952598095, 0.01759243942797184, -0.02242845669388771, -0.01882365718483925, 0.0019451957195997238, -0.0061370451003313065, 0.0021006844472140074, -0.0014366841642186046, -0.011169802397489548, -0.005327869206666946, -0.011430008336901665, -0.021552642807364464, 0.005191419739276171, 0.00556586217135191, -0.0002193501713918522, -0.01271834410727024, 0.003430271754041314, 0.02468780241906643, -0.001783360610716045, 0.0012550161918625236, -0.005445278715342283, -0.024802040308713913, -0.03056464157998562, -0.016120055690407753, 0.016729317605495453, -0.0132387550547719, -0.008726408705115318, 0.009507025592029095, -0.007342875935137272, 0.007031898479908705, -0.005689618177711964, -0.012045617215335369, -0.023786602541804314, 0.028787627816200256, -0.01595504768192768, -0.0033382480032742023, 0.0052675772458314896, -0.01680547557771206, 0.0014319242909550667, -0.02185727283358574, -0.019648699089884758, -0.0063306125812232494, 0.016691239550709724, 0.008770833723247051, 0.0041855028830468655, -0.013822630979120731, -0.012870659120380878, 0.009513371624052525, 0.005797508638352156, 0.0013898789184167981, 0.025322450324892998, -0.01782091334462166, 0.015396557748317719, 0.002041979692876339, -0.011068259365856647, 0.007406340911984444, 0.0015818598913028836, 0.015904275700449944, 0.01345453504472971, -0.002713119611144066, 0.002114964183419943, 0.014178033918142319, -0.002319637918844819, -0.00424896739423275, -0.006555912550538778, 0.0030748690478503704, -0.004699567798525095, 0.0132387550547719, -0.017452817410230637, -0.011157109402120113, -0.029676135629415512, 0.0036587449721992016, 0.007476151920855045, 0.016094669699668884, -0.013797244988381863, -0.017224343493580818, -0.003760288702324033, 0.02143840491771698, 0.017046641558408737, 0.019280603155493736, 0.006873236503452063, -0.013898788951337337, -0.009253166615962982, -0.002367236651480198, -0.020930686965584755, -0.0052548847161233425, -0.0015001489082351327, 0.006432156544178724, 0.0030336168128997087, 0.0029289000667631626, -0.007374608423560858, 0.0012145574437454343, -0.00209909793920815, -0.0019245697185397148, 0.01860787533223629, 0.0007635607616975904, 0.015104619786143303, 0.007025551982223988, 0.0013660795520991087, 0.01637391559779644, -0.008713715709745884, 0.01675470359623432, -0.000449806684628129, -0.007730011362582445, 0.01678008958697319, -0.0008107626927085221, -0.028026049956679344, 0.010909597389400005, 9.54450952121988e-05, -0.00607040710747242, -0.011277693323791027, -0.02749294601380825, 0.008897763676941395, 0.012857966125011444, 0.016843555495142937, -0.01757974736392498, 0.014685751870274544, -0.003969722427427769, 0.00809176079928875, -0.001878557726740837, -0.01881096325814724, 0.03419482707977295, 0.020956072956323624, 0.016513537615537643, 0.022199982777237892, 0.015396557748317719, -0.0009591116104274988, 0.004474267829209566, 0.0005100982380099595, -0.007774436846375465, -0.026198264211416245, 0.009856081567704678, -0.0067145745269954205, 0.01476190984249115, -0.02588094025850296, -0.002365649910643697, -0.0066320705227553844, 0.006701881531625986, -0.0012304235715419054, -0.018658647313714027, 0.0021974684204906225, -0.017846299335360527, 0.004924867767840624, 0.0031240542884916067, -0.021781114861369133, 0.029879221692681313, 0.011848876252770424, -0.0027067733462899923, -0.011074605397880077, -0.01736396551132202, 0.007361915428191423, -0.012356594204902649, 0.003303342266008258, 0.007203253451734781, 0.014406506903469563, 0.0011756852036342025, -0.009627608582377434, 0.014051103964447975, 0.00063147465698421, 0.04612620919942856, -0.02079106494784355, 0.03160546347498894, -0.005131128244102001, 0.006568605545908213, -0.025385916233062744, -0.028203751891851425, -0.02346927858889103, 0.026198264211416245, -0.01314990408718586, -0.022314218804240227, -0.0005513503565452993, 0.023405814543366432, -0.007723664864897728, 0.006511487532407045, -0.0060228086076676846, -0.012489870190620422, -0.0021498696878552437, 0.024015076458454132, -0.0033287282567471266, -0.029447661712765694, 0.001962648704648018, 0.007660199888050556, -0.0008147292537614703, -0.030463099479675293, -0.017135493457317352, -0.008853337727487087, -0.013518000021576881, 0.07803630083799362, -0.004829670302569866, 0.015168084762990475, 0.008256768807768822, 0.03680957853794098, 0.0005342941731214523, -0.0388658381998539, -0.004674181807786226, -0.005423066206276417, -0.012166200205683708, -0.006727267522364855, 0.009678380563855171, 0.024928968399763107, 0.007114402949810028, 0.026375966146588326, -0.004309259355068207, -0.0059434776194393635, -0.024624338373541832, 0.019318681210279465, -0.023799296468496323, -0.008218689821660519, 0.01661508157849312, 0.01599312759935856, 0.0270867720246315, -0.01525693479925394, 0.004388590343296528, 0.02551284432411194, 0.026198264211416245, -0.0011399862123653293, -0.023393120616674423, 0.0015755133936181664, -0.0012439098209142685, -0.005004198756068945, -0.0023926226422190666, -0.01554887369275093, 0.00479793781414628, 0.00044465018436312675, -0.012242358177900314, 0.004905828274786472, -0.00627032108604908, 0.040515922009944916, -0.008732754737138748, 0.005099395755678415, -0.01695779152214527, 0.0046519688330590725, -0.001635804888792336, -0.027772191911935806, 0.05097491666674614, -0.030437713488936424, -0.0028495690785348415, 0.01537117175757885, 0.027137544006109238, 0.0023434374015778303, -0.010427264496684074, -0.004321951884776354, 0.011163456365466118, -0.0066320705227553844, -0.02426893450319767, -0.014000331982970238, 0.01619621366262436, -0.014698444865643978, -0.037698086351156235, -0.005502397194504738, -0.0007306383922696114, -0.025944406166672707, -0.0204483550041914, -0.012616800144314766, -0.012413712218403816, -0.0028527423273772, -0.002898754319176078, -0.012439098209142685, 0.003757115453481674, -0.012775462120771408, -0.007031898479908705, 0.01737665943801403, -0.0025734971277415752, -0.0034905634820461273, -0.009754537604749203, -0.0010392359690740705, 0.009913199581205845, 0.0007726838230155408, -0.00818695779889822, 0.001354179927147925, 0.0036492254585027695, -0.029244573786854744, 0.022771166637539864, 0.026579054072499275, 0.01111268438398838, 0.005435759201645851, 0.0043378183618187904, -0.00217684218659997, -0.0025211386382579803, 0.005093049257993698, -0.01558695174753666, -0.005457971710711718, -0.021958816796541214, -0.016234293580055237, 0.025170134380459785, -0.008453509770333767, -0.003265263279899955, -0.008155225776135921, 0.0019277429673820734, -0.00929124467074871, 0.0006160050979815423, 0.043587617576122284, -0.0084979347884655, -0.011353850364685059, -0.025005126371979713, 0.004277526866644621, -0.011157109402120113, 0.020473740994930267, 0.014888839796185493, -0.01900135725736618, 0.0075523098930716515, -0.012128121219575405, 0.03051386959850788, 0.012172546237707138, 0.032468587160110474, 0.0035952802281826735, -0.009037385694682598, -0.007387301418930292, -0.0064511955715715885, 0.02504320628941059, -0.012261397205293179, 0.009475292637944221, -0.000981324352324009, 0.012502563185989857, -0.013226062059402466, -0.0014819027855992317, -0.012762769125401974, -0.0036841309629380703, 0.007139788940548897, -0.010446304455399513, 0.010046476498246193, -0.004236274864524603, -0.0025639773812144995, -0.004179156385362148, 0.010877864435315132, -0.025627082213759422, -0.024142006412148476, -0.04018590599298477, -0.015244241803884506, 0.012902391143143177, -0.013276834040880203, -0.028660697862505913, -0.023494664579629898, -0.0049153477884829044, -0.008034641854465008, -0.01619621366262436, 0.05150802433490753, 0.011785411275923252, 0.009221433661878109, -0.03170700743794441, 0.03960202634334564, 0.00464244931936264, -0.014228805899620056, -0.014799988828599453, -0.006511487532407045, 0.004518692847341299, 0.027137544006109238, 0.021717650815844536, -0.0002318448096048087, 0.01963600516319275, 0.003693650709465146, -0.00012375634105410427, -0.0067145745269954205, -0.010890557430684566, -0.0046075438149273396, -0.030361555516719818, 0.029650749638676643, 0.026553668081760406, 0.014825374819338322, 0.00979896355420351, 0.009265859611332417, -0.020930686965584755, 0.003636532463133335, 0.004655142314732075, -0.008675636723637581, -0.009564143605530262, -0.013873402960598469, 0.017706675454974174, -0.02749294601380825, 0.00500737177208066, 0.0072095999494194984, 0.03300169110298157, -0.007539616897702217, 0.02264423668384552, 0.006251281592994928, 0.016081977635622025, -0.00035222957376390696, 0.028635311871767044, -0.014444585889577866, 0.002524311887100339, -0.010186098515987396, -0.017325887456536293, 0.010395532473921776, -0.005264404229819775, -0.015358478762209415, -0.01841748133301735, -0.0003563944483175874, 0.027645261958241463, 0.001110633835196495, 0.005058143753558397, -0.013441842049360275, -0.007945791818201542, 0.005061316769570112, 0.013505307026207447, -0.01436842791736126, -0.0047598592936992645, -0.02612210623919964, -0.018747499212622643, -0.01959792710840702, -0.012642186135053635, -0.029803065583109856, -0.009849735535681248, -0.0033763267565518618, -0.041353657841682434, 0.013073746114969254, -0.009424521587789059, -0.03818041831254959, -0.0007080290233716369, -0.003976068925112486, -0.01426688488572836, -0.003928470425307751, 0.016691239550709724, -0.0007036658353172243, -0.01738935150206089, -0.01556156575679779, 0.029574591666460037, -0.004325125366449356, -0.009837042540311813, -5.513503492693417e-05, 0.011506166309118271, 0.02506859228014946, -0.021895352751016617, -0.018925199285149574, 0.021565334871411324, 0.010116287507116795, -0.022885402664542198, 0.013644929975271225, -0.004677354823797941, 0.029676135629415512, -0.012819887138903141, 0.018341323360800743, 0.0005545236053876579, 0.012921431101858616, -0.020943380892276764, 0.00348421698436141, 0.003636532463133335, 0.006746307015419006, -0.030006151646375656, -0.002124483697116375, -0.02428162842988968, 0.026172878220677376, -0.009849735535681248, -0.010236870497465134, 0.008155225776135921, -0.01000839751213789, -0.013099132105708122, 0.021882658824324608, -0.010941329412162304, 0.008364658802747726, -0.008561399765312672, 0.016450073570013046, -0.0036746112164109945, -0.009722805581986904, 0.013479921035468578, -0.007850594818592072, 0.018100157380104065, 0.019458305090665817, -0.022479228675365448, -0.023520050570368767, 0.0036746112164109945, 0.009386442601680756, 0.02728985995054245, -0.007120749447494745, -0.015206163749098778, -0.01702125556766987, -0.004588504321873188, -0.013644929975271225, -0.005619807168841362, 0.010439957492053509, 0.005054970271885395, 0.008174264803528786, -0.0007171520846895874, -0.03251935914158821, -0.028229137882590294, 0.004782071802765131, 0.006076753605157137, -0.016018513590097427, -0.021768422797322273, -0.020943380892276764, 0.0015620271442458034, -0.0016532577574253082, 0.024763960391283035, -0.001965821720659733, -0.012407366186380386, 0.015269627794623375, -0.012680265121161938, 0.009018346667289734, -0.010236870497465134, 0.019140981137752533, -0.0254620723426342, 0.008472549729049206, 0.003325555007904768, 0.012997589074075222, 0.02244114875793457, -0.008954881690442562, -0.02321542054414749, -0.01636122167110443, 0.0012280436931177974, -0.004296566359698772, 0.01820170134305954, -0.005746736656874418, 0.026147492229938507, 0.005277097225189209, 0.006695535033941269, -0.006263974588364363, -0.018074771389365196, 0.019483689218759537, -0.017846299335360527, -0.001215350697748363, 0.02726447395980358, -0.015878889709711075, -0.02060067094862461, 0.03985588625073433, 0.008662943728268147, -0.0022085746750235558, -0.029422275722026825, 0.009342016652226448, -0.0216034147888422, 0.03599722683429718, -0.01424149889498949, -0.014584208838641644, -0.023190034553408623, 0.011563284322619438, -0.01660238951444626, 0.020334118977189064, 0.006397250574082136, -0.013530693016946316, 0.01641199365258217, 0.013187983073294163, 0.0198390930891037, -0.001444617286324501, 0.016259679570794106, 0.004731299821287394, -0.013822630979120731, 0.0078886728733778, -0.036098770797252655, -0.02711215801537037, -0.009938585571944714, 0.009659340605139732, -0.004436188843101263, -0.00979896355420351, -0.014165340922772884, 0.00991954654455185, -0.04305451363325119, 0.02466241642832756, -0.010592273436486721, 0.00479793781414628, 0.011074605397880077, 0.021679572761058807, -0.023570822551846504, 0.006720921024680138, -0.03109774738550186, 0.005845107138156891, -0.0051057422533631325, -0.013822630979120731, -0.006568605545908213, 0.0003934816922992468, 0.009443560615181923, -0.009754537604749203, -0.04241986572742462, -0.01102383341640234, 0.00868198275566101, 0.002452914137393236, 0.012077349238097668, -0.006816118489950895, -0.01406379695981741, -0.007038244977593422, 0.0018388922326266766, 0.014419199898838997, 0.03312861919403076, 0.0052548847161233425, -0.0016707105096429586, -0.012781808152794838, -0.015320399776101112, 0.018328631296753883, -0.005807028152048588, -0.048207852989435196, -0.017732061445713043, 0.009202394634485245, -0.010871518403291702, -9.35237949306611e-06, -0.015840811654925346, -0.028178365901112556, 0.017668597400188446, -0.017300501465797424, -0.0026385486125946045, -0.02246653474867344, -0.01719895750284195, 0.015193470753729343, 0.007952137850224972, -0.019064823165535927, 0.007907712832093239, -0.0001243513252120465, -0.019509075209498405, 0.016450073570013046, 0.007082670461386442, 0.000174924818566069, -0.00931663066148758, -0.015904275700449944, 0.004943907260894775, -0.0059434776194393635, -0.020981458947062492, 0.003519122488796711, 0.0039221239276230335, -0.0016437380108982325, 0.00444253534078598, 0.01271834410727024, -0.014888839796185493, 0.01242640521377325, 0.0023450239095836878, -0.003804714186117053, 0.0004716227122116834, -0.008846991695463657, 0.015815425664186478, -0.01736396551132202, -0.016729317605495453, -0.005210459232330322, -0.0222126767039299, -0.02061336301267147, 0.018074771389365196, 0.009354709647595882, -0.007710971869528294, 0.02589363418519497, 0.21933430433273315, 0.012007538229227066, -0.005045450758188963, 0.03741883859038353, -0.0003673024766612798, 0.031427763402462006, 0.001835718983784318, 0.0024925796315073967, -0.01716087944805622, 0.013187983073294163, -0.011493473313748837, -0.0066003380343317986, 0.0015533006517216563, -0.0035064294934272766, 0.006263974588364363, -0.00490265479311347, -0.02506859228014946, -0.02383737452328205, 0.00027567517827264965, -0.03556566685438156, 0.010681124404072762, -0.01655161753296852, 0.0008781939977779984, -0.017325887456536293, 0.03777424246072769, 0.0019404359627515078, -0.04404456168413162, 0.006498794537037611, 0.01396225392818451, 0.024421250447630882, -0.01901405118405819, -0.008650250732898712, 0.00590539863333106, 0.0016437380108982325, -0.014406506903469563, 0.013073746114969254, 0.006949394475668669, 0.003925297409296036, 0.005743563175201416, -0.003804714186117053, 0.009881467558443546, -0.01314990408718586, 0.017351273447275162, -0.016500845551490784, 0.01736396551132202, 0.024510100483894348, -0.018747499212622643, -0.02726447395980358, 0.003209731774404645, 0.036504946649074554, -0.015180777758359909, -0.018760191276669502, 0.006476581562310457, 0.010154366493225098, 0.005454798694700003, 0.009183354675769806, 0.02604595012962818, -0.02020718902349472, -0.019889865070581436, -0.0060672336257994175, 0.010674777440726757, 0.009475292637944221, -0.01636122167110443, 0.0009384855511598289, -0.030082309618592262, 0.009640301577746868, -0.014876146800816059, 0.014317655935883522, -0.0032589170150458813, -0.01600581966340542, -0.0014382707886397839, -0.025030512362718582, 0.0001913860032800585, 0.022288834676146507, -0.0090056536719203, -0.010046476498246193, 0.02487819641828537, -0.012832580134272575, 0.019547155126929283, 0.03500717878341675, -0.026807526126503944, -9.27800647332333e-06, -0.006790732499212027, -0.011220574378967285, -0.01694509945809841, -0.03013308160007, 0.004064919892698526, 0.01454612985253334, -0.018963279202580452, -0.020752985030412674, 0.011334811337292194, -0.012610453180968761, -9.286683780374005e-05, -0.0013240341795608401, 0.017871685326099396, 0.00566105917096138, -0.006549566052854061, 0.0101924454793334, 0.003293822519481182, -0.0114109693095088, -0.010934983380138874, -0.055087435990571976, -0.009437213651835918, -0.004931214265525341, -0.028762241825461388, -0.0031383337918668985, 0.0027686513494700193, 0.03678419068455696, 0.0032129050232470036, -0.0055595156736671925, -0.002589363371953368, -0.00025762736913748085, 0.017935149371623993, -0.0015326746506616473, 0.002351370407268405, -0.002684560604393482, -0.016932405531406403, 0.0035794139839708805, 0.030285397544503212, -0.023964304476976395, 0.018760191276669502, -0.019153673201799393, -0.0029860183130949736, 0.03338247910141945, -0.020549898967146873, -0.012953163124620914, -0.011468087323009968, 0.01202657725661993, 0.02544938027858734, -0.011899648234248161, 0.038535818457603455, -0.0033795000053942204, -0.007958484813570976, 0.02004218101501465, -0.03371249511837959, -0.01879827119410038, 0.009602222591638565, 0.01817631535232067, -0.026832912117242813, -0.012216972187161446, 0.024802040308713913, 0.0008067961316555738, -0.0010781080927699804, 0.006394077558070421, -0.005039104260504246, -0.035489510744810104, 0.012280436232686043, 0.0075903888791799545, -0.029980765655636787, -0.018290551379323006, -0.030894659459590912, -0.014558822847902775, -0.017237037420272827, -0.017237037420272827, 0.02490358240902424, -0.02021988108754158, -0.04470459744334221, -0.005648366175591946, -0.013822630979120731, -0.0008512214990332723, -0.002835289342328906, -0.0064797550439834595, 0.053056564182043076, -0.011702907271683216, 0.008079067803919315, 0.005632500164210796, -0.16145442426204681, 0.00919604767113924, -0.02463703043758869, -0.01637391559779644, 0.01573926769196987, 0.0006715367780998349, 0.023190034553408623, -0.007431726902723312, -0.018138237297534943, 0.018887121230363846, 0.010243216529488564, 0.010427264496684074, -0.033077847212553024, 0.0023973823990672827, 0.01901405118405819, 0.016538923606276512, 0.0001445807283744216, -0.01436842791736126, 0.02324080653488636, 0.019674085080623627, 0.0383327342569828, 0.0026798006147146225, 0.0010820745956152678, -0.007565002888441086, 0.002755958354100585, 0.03056464157998562, -0.025550924241542816, 0.00374442245811224, -0.011061912402510643, 0.0017738408641889691, 0.0059434776194393635, -0.002909860573709011, 0.02551284432411194, -0.008472549729049206, 0.010255909524857998, 0.005410373210906982, 0.00012464881001506, -0.00657495204359293, 0.01782091334462166, 0.035311806946992874, 0.013213369064033031, 0.02789912186563015, -0.0014057450462132692, 0.014914225786924362, -0.009792616590857506, 0.009875121526420116, 0.009335670620203018, -0.0017548013711348176, 0.023596208542585373, -0.004728126805275679, 0.009418174624443054, -0.03736806660890579, 0.016069283708930016, 0.0011875848285853863, 0.0022276141680777073, 0.016995869576931, -0.014114568941295147, 0.0014454105403274298, -0.005883186124265194, -0.0006877996493130922, -0.012312169186770916, -0.011309425346553326, -0.013187983073294163, 0.0020578457042574883, -0.0012621559435501695, -0.004007801413536072, -0.006362345069646835, -0.014876146800816059, 0.006511487532407045, 0.005997422616928816, -0.0024862331338226795, 0.00270835985429585, 0.003430271754041314, 0.007520577404648066, 5.726705421693623e-05, 0.02346927858889103, -0.017643211409449577, -0.006549566052854061, 0.021781114861369133, -0.023190034553408623, -0.015130005776882172, 0.03414405509829521, -0.025995178148150444, 0.021336862817406654, -0.015663109719753265, 0.0021958816796541214, 0.004166463389992714, 0.014990382827818394, 0.014228805899620056, -0.0074380734004080296, 0.007380954921245575, -0.003550854977220297, -0.00931663066148758, -0.025601696223020554, 0.018112851306796074, 0.011036526411771774, 0.009031039662659168, 0.01050342246890068, -0.0057943351566791534, -0.0036397057119756937, 0.005588074680417776, -0.021590720862150192, -0.028762241825461388, 0.025538230314850807, 0.01637391559779644, 0.0335855670273304, 0.012375634163618088, 0.0270867720246315, 0.019496383145451546, -0.0051850732415914536, -0.020067567005753517, 0.010287642478942871, 0.019902557134628296, 0.02543668821454048, -0.010750935412943363, 0.03889122232794762, -0.015041154809296131, -0.02544938027858734, 0.030412327498197556, -0.009132582694292068, 0.046608541160821915, 0.0008095726952888072, 0.0017119626281782985, 0.012902391143143177, -0.0007623707642778754, 0.0033350747544318438, -0.10783936828374863, -0.022948866710066795, 0.020587977021932602, 0.020524512976408005, -0.00627032108604908, -0.00531200272962451, 0.009322977624833584, 0.01354338601231575, -0.014279577881097794, 0.0036746112164109945, -0.011245960369706154, -0.0180113073438406, -0.015320399776101112, -0.01363223697990179, 0.02364698052406311, 0.008472549729049206, 0.025182828307151794, -0.028660697862505913, -0.00040696797077544034, 0.005166033748537302, -0.0007115989574231207, 0.011442701332271099, -0.004966119769960642, 0.006778039503842592, -0.004325125366449356, 0.0075523098930716515, -0.009031039662659168, 0.029853835701942444, 0.007222292944788933, 0.011258653365075588, 0.02426893450319767, -0.009938585571944714, 0.017275115475058556, -0.00399828189983964, -0.011671174317598343, -0.0005457971710711718, -0.02466241642832756, 0.002365649910643697, 0.014774602837860584, -0.026959842070937157, 0.012813541106879711, -0.007425380405038595, -0.002352957148104906, -0.047623977065086365, 0.006841504015028477, -0.004474267829209566, 0.00031613398459739983, 0.018709419295191765, 0.022923482581973076, -0.007025551982223988, -0.00374442245811224, 0.025830168277025223, -0.029599977657198906, 0.004613890312612057, 0.04168367385864258, -0.005908571649342775, 0.016653161495923996, -0.0018690379802137613, -0.009748191572725773, -0.006606684532016516, 0.006733614020049572, -0.0011645788326859474, -0.02020718902349472, 0.007939444854855537, 0.008256768807768822, 0.01598043367266655, -0.011093645356595516, -0.002403728896752, 0.005115261767059565, -0.015142698772251606, 0.012051963247358799, -0.006482928059995174, -0.01660238951444626, -0.008999306708574295, -0.010097247548401356, -0.03868813440203667, -0.034093283116817474, 0.00566105917096138, -3.143490175716579e-05, -0.02260615862905979, 0.002024526707828045, -0.009729152545332909, 0.0074380734004080296, -0.0011558524565771222, -0.0007151688332669437, -0.020169109106063843, -0.010205138474702835, -0.006720921024680138, -0.007444419898092747, -0.015866197645664215, -0.004344164859503508, 0.011201535351574421, 0.03114851750433445, -0.01363223697990179, -0.01694509945809841, 0.01816362328827381, -0.014495357871055603, -0.00209433794952929, 0.01741473749279976, -0.02362159453332424, -0.006254455074667931, -0.01010359451174736, -0.04018590599298477, 0.006917661987245083, -0.017858991399407387, -0.006790732499212027, 0.008745447732508183, -0.01000839751213789, 0.016742011532187462, 0.010059168562293053, -0.008332926779985428, 0.01702125556766987, -0.01062400545924902, 0.012711997143924236, 0.01373378001153469, 0.007939444854855537, -0.017135493457317352, -0.008878723718225956, 0.015409250743687153, 0.005191419739276171, 0.022339604794979095, -0.009234126657247543, 0.022314218804240227, 0.03031078353524208, -0.004604370333254337, -0.0006513074040412903, -0.020346811041235924, 0.021908044815063477, -0.013276834040880203, 0.016830861568450928, -0.027594489976763725, -0.010954022407531738, 0.011582324281334877, -0.024611644446849823, 0.003360460512340069, 0.02604595012962818, -0.014406506903469563, -0.030006151646375656, -0.004131557885557413, 0.012274090200662613, 0.009665687568485737, 0.002682973863556981, -0.006555912550538778, -0.03678419068455696, 0.011011140421032906, -0.023710444569587708, -0.011912341229617596, 0.014939610846340656, -0.016094669699668884, -0.004020494408905506, 0.018722113221883774, 0.003877698676660657, -0.008218689821660519, 0.011144417338073254, 0.01052246242761612, -0.01920444518327713, 0.01576465368270874, 0.0014105049194768071, 0.005946650635451078, -0.011829836294054985, 0.005115261767059565, -0.03114851750433445, 0.03594645485281944, -0.009138929657638073, 0.008808912709355354, -0.009132582694292068, -0.004734473302960396, -0.013581464998424053, -0.016703931614756584, -0.013683008030056953, 0.014698444865643978, -0.029853835701942444, -0.0186205692589283, 0.005134301260113716, 0.01982639916241169, 0.011201535351574421, 0.03924662619829178, -0.017909763380885124, -0.00696843396872282, -0.028609925881028175, -0.00830754078924656, 0.01082709338515997, 0.013619543984532356, 0.0198390930891037, -0.02444663643836975, 0.010871518403291702, 0.010293988510966301, 0.024725882336497307, -0.016665853559970856, -0.001294681685976684, 0.005467491690069437, 0.004572637844830751, -0.004639275837689638, -0.013314913026988506, 0.011214228346943855, -0.001549334148876369, 0.003982415422797203, 0.02524629235267639, -0.0030637625604867935, -0.007907712832093239, 0.017858991399407387, 0.031250063329935074, -0.005384987220168114, 0.004639275837689638, 0.0029923648107796907, -0.007171520963311195, -0.01202657725661993, -0.016285065561532974, -0.03389019891619682, -0.0429275818169117, 0.009050078690052032, 0.0073999944142997265, 0.01822708733379841, 0.016716625541448593, -0.003995108418166637, 0.02261885069310665, 0.007495191413909197, 0.0121217742562294, -0.0013938454212620854, -0.00581654766574502, -0.01902674324810505, 0.026959842070937157, 0.0030161640606820583, 0.012159853242337704, 0.00788232684135437, -0.020511819049715996, 0.006016462109982967, 0.017237037420272827, -0.004042706917971373, 0.00016520677309017628, 0.001097147585824132, 0.005162860732525587, -0.0015033221570774913, 0.009475292637944221, -0.016246985644102097, -0.010344760492444038, -0.014508050866425037, 0.007069977466017008, 0.016018513590097427, 0.01883634924888611, -0.02524629235267639, 0.036885734647512436, 0.004436188843101263, 0.008688329719007015, 0.0038999111857265234, -0.007875979878008366, 0.005365947727113962, 0.028051435947418213, -0.020169109106063843, -0.0063274395652115345, 0.0045282128266990185, 0.02443394437432289, 0.007584042381495237, 0.005743563175201416, -0.012502563185989857, -0.026147492229938507, -0.0029812585562467575, 0.00039308503619395196, 0.0008845404954627156, -0.028965329751372337, -0.023418506607413292, 0.00870736874639988, 0.018684033304452896, 0.014406506903469563, 0.028229137882590294, -0.013949560932815075, -0.0031478535383939743, 0.001919809845276177, -0.0034334450028836727, 0.012997589074075222, -0.040947481989860535, 0.0025719106197357178, -0.0018801443511620164, -0.049451764672994614, -0.008846991695463657, -0.004540905822068453, -0.021793808788061142, -0.014101875945925713, -0.015472715720534325, 0.0040744394063949585, 0.002773411339148879, -0.03137699142098427, 0.041125182062387466, -0.017643211409449577, -0.0186205692589283, 0.014508050866425037, 0.010420918464660645, -0.015383864752948284, -0.01938214711844921, -0.002728985855355859], index=0, object='embedding')], model='text-embedding-ada-002', object='list', usage=Usage(prompt_tokens=8, total_tokens=8))\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import openai\n",
    "import dotenv\n",
    "def initialise():\n",
    "    dotenv.load_dotenv()\n",
    "    use_azure_active_directory = False  # Set this flag to True if you are using Azure Active Directory (Code been removed)\n",
    "    if not use_azure_active_directory:\n",
    "        endpoint = os.environ[\"AZURE_OPENAI_ENDPOINT\"]\n",
    "        api_key = os.environ[\"AZURE_OPENAI_API_KEY\"]\n",
    "\n",
    "        client = openai.AzureOpenAI(\n",
    "            azure_endpoint=endpoint,\n",
    "            api_key=api_key,\n",
    "            api_version=\"2023-09-01-preview\"\n",
    "        )\n",
    "        return client\n",
    "client = initialise()\n",
    "\n",
    "deployment = \"text-embedding-ada-002-wus\" # Fill in the deployment name from the portal here\n",
    "embeddings = client.embeddings.create(\n",
    "    model=deployment,\n",
    "    input=\"The food was delicious and the waiter...\"\n",
    ")\n",
    "#Test that embeddings are working/ connection active.              \n",
    "#print(embeddings)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Function that reads a PDF, creates a knowledge graph in neo4j, and adds embeddings.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection established.\n"
     ]
    }
   ],
   "source": [
    "##Initialise Neo4j\n",
    "#Ensures that connection is successful \n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "URI = \"bolt://localhost:7687\"\n",
    "AUTH = (\"neo4j\", \"m0del2_pass\")\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "    print(\"Connection established.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "A lot of the following code was reused from the following repository:<br>\n",
    "https://github.com/Joshua-Yu/graph-rag/blob/main/openai%2Bllamaparse/demo_neo4j_vectordb.ipynb<br><br>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started parsing the file under job_id e73977dd-ce34-42c0-9de6-85d974f5556f\n",
      ".Number of documents: 285\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.54s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.07s/it]\n",
      "3it [00:00, ?it/s]\n",
      "100%|██████████| 3/3 [00:02<00:00,  1.01it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, 87.67it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.24s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:01<00:00,  1.39it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "3it [00:00, 3240.51it/s]\n",
      "100%|██████████| 3/3 [00:01<00:00,  1.57it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.49s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.31s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.48s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.62s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.22s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.44s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.25s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.39s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.43s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.17s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.41s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.17s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "c:\\Users\\GeorgeChant\\RAG_model_1\\Lib\\site-packages\\pydantic\\v1\\validators.py:61: RuntimeWarning: coroutine 'LlamaParse.aload_data' was never awaited\n",
      "  if isinstance(v, Enum):\n",
      "RuntimeWarning: Enable tracemalloc to get the object allocation traceback\n",
      "  0%|          | 0/1 [56:38<?, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.45s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.34s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:01<00:00,  1.15it/s]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:02<00:00,  1.23s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:01<00:00,  1.38it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.57s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.37s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.61s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:03<00:00,  1.97s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.76s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.97s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.31s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.22s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.86s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:01<00:00,  1.07it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.65s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.91s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:01<00:00,  1.19it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.72s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.46s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.56s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.58s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.78s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.58s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.25s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.89s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.47s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.27s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.81s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.19s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.11s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  2.00s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.12s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.70s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.90s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.01s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, 1960.87it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.29s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:02<00:00,  1.16s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.68s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.65s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.62s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.37s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.12s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.38s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:03<00:00,  1.68s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.63s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, 1000.55it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.36s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:03<00:00,  1.73s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.28s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.84s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.59s/it]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:02<00:00,  1.44s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.87s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.91s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.61s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.22s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.56s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.58s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.42s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.94s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.91s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.28s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.64s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.32s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.91s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.64s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.33s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.35s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.34s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.24s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.66s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.44s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.71s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:02<00:00,  2.59s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.46s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "1it [00:00, 1021.75it/s]\n",
      "100%|██████████| 1/1 [00:03<00:00,  3.46s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "2it [00:00, ?it/s]\n",
      "100%|██████████| 2/2 [00:02<00:00,  1.03s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.52s/it]\n",
      "1it [00:00, ?it/s]\n",
      "100%|██████████| 1/1 [00:01<00:00,  1.44s/it]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]\n",
      "0it [00:00, ?it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of nodes: 389\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "from llama_parse import LlamaParse\n",
    "from llama_index.core.node_parser import MarkdownElementNodeParser\n",
    "import nest_asyncio; \n",
    "nest_asyncio.apply()\n",
    "from llama_index.llms.openai import OpenAI\n",
    "from llama_index.core import Settings\n",
    "\n",
    "os.environ[\"OPENAI_API_KEY\"] = key\n",
    "\n",
    "EMBEDDING_MODEL  = \"text-embedding-ada-002\"\n",
    "GENERATION_MODEL = \"gpt-3.5-turbo\"\n",
    "\n",
    "llm = OpenAI(model=GENERATION_MODEL) #Using the free 3.5 model for now\n",
    "\n",
    "Settings.llm = llm\n",
    "\n",
    "## As this only gets preformed once, I decided to change the file name manually. \n",
    "## If in the future, you may need to change to include a for loop to iterate through the file.\n",
    "## An example can be found in the Model 1 jupyter notebook.\n",
    "pdf_file_name = './Vector_docs/ECB_Doc.pdf'\n",
    "\n",
    "LlamaParse_api_key = os.environ[\"Llama_parse_API_key\"]\n",
    "documents = LlamaParse(api_key=LlamaParse_api_key,result_type=\"markdown\").load_data(pdf_file_name) #You will be required to create your own LlamaParse key to parse documents.\n",
    "\n",
    "print(f\"Number of documents: {len(documents)}\")\n",
    "# Parse the documents using MarkdownElementNodeParser\n",
    "node_parser = MarkdownElementNodeParser(llm=llm, num_workers=8)\n",
    "\n",
    "# Retrieve nodes (text) and objects (table)\n",
    "nodes = node_parser.get_nodes_from_documents(documents)\n",
    "\n",
    "#convert nodes to documents\n",
    "base_nodes, objects = node_parser.get_nodes_and_objects(nodes)\n",
    "\n",
    "print(f\"Number of nodes: {len(base_nodes)}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Local Neo4j instance\n",
    "# NEO4J_URL = \"bolt://localhost:7687\"\n",
    "# Remote Neo4j instance on AuraDB\n",
    "NEO4J_URL = \"bolt://localhost:7687\"\n",
    "NEO4J_USER = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"m0del2_pass\"\n",
    "NEO4J_DATABASE = \"neo4j\"\n",
    "\n",
    "#We shall now create our knowledge graph's basic format. We create a section, chunk and document.\n",
    "def initialiseNeo4jSchema():\n",
    "    cypher_schema = [\n",
    "        \"CREATE CONSTRAINT sectionKey IF NOT EXISTS FOR (c:Section) REQUIRE (c.key) IS UNIQUE;\",\n",
    "        \"CREATE CONSTRAINT chunkKey IF NOT EXISTS FOR (c:Chunk) REQUIRE (c.key) IS UNIQUE;\",\n",
    "        \"CREATE CONSTRAINT documentKey IF NOT EXISTS FOR (c:Document) REQUIRE (c.url_hash) IS UNIQUE;\",\n",
    "        \"CREATE VECTOR INDEX `chunkVectorIndex` IF NOT EXISTS FOR (e:Embedding) ON (e.value) OPTIONS { indexConfig: {`vector.dimensions`: 1536, `vector.similarity_function`: 'cosine'}};\"\n",
    "    ]\n",
    "\n",
    "    driver = GraphDatabase.driver(NEO4J_URL, database=NEO4J_DATABASE, auth=(NEO4J_USER, NEO4J_PASSWORD))\n",
    "\n",
    "    with driver.session() as session:\n",
    "        for cypher in cypher_schema:\n",
    "            session.run(cypher)\n",
    "    driver.close()\n",
    "\n",
    "# create constraints and indexes\n",
    "initialiseNeo4jSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "TABLE_REF_SUFFIX = '_table_ref'\n",
    "TABLE_ID_SUFFIX  = '_table'\n",
    "\n",
    "# Check parsed objects \n",
    "\n",
    "print(f\"Number of objects: {len(objects)}\")\n",
    "\n",
    "#Iterate through each node in the list created, printing ids and other basic info\n",
    "for node in objects: \n",
    "    print(f\"id:{node.node_id}\")\n",
    "    print(f\"hash:{node.hash}\")\n",
    "    print(f\"parent:{node.parent_node}\")\n",
    "    print(f\"prev:{node.prev_node}\")\n",
    "    print(f\"next:{node.next_node}\")\n",
    "\n",
    "    # Check to see if an object is a table\n",
    "    if node.node_id[-1 * len(TABLE_REF_SUFFIX):] == TABLE_REF_SUFFIX:\n",
    "\n",
    "        if node.next_node is not None:\n",
    "            next_node = node.next_node\n",
    "        \n",
    "            print(f\"next_node metadata:{next_node.metadata}\")\n",
    "            print(f\"next_next_node:{next_next_nod_id}\")\n",
    "\n",
    "            obj_metadata = json.loads(str(next_node.json()))\n",
    "\n",
    "            print(str(obj_metadata))\n",
    "\n",
    "            print(f\"def:{obj_metadata['metadata']['table_df']}\")\n",
    "            print(f\"summary:{obj_metadata['metadata']['table_summary']}\")\n",
    "\n",
    "    #print additional information about current node\n",
    "    print(f\"next:{node.next_node}\")\n",
    "    print(f\"type:{node.get_type()}\")\n",
    "    print(f\"class:{node.class_name()}\")\n",
    "    print(f\"content:{node.get_content()[:200]}\")\n",
    "    print(f\"metadata:{node.metadata}\")\n",
    "    print(f\"extra:{node.extra_info}\")\n",
    "    \n",
    "    node_json = json.loads(node.json())\n",
    "\n",
    "    print(f\"start_idx:{node_json.get('start_char_idx')}\")\n",
    "    print(f\"end_idx:{node_json['end_char_idx']}\")\n",
    "\n",
    "    if 'table_summary' in node_json: \n",
    "        print(f\"summary:{node_json['table_summary']}\")\n",
    "\n",
    "    print(\"=====================================\")   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Start saving documents to Neo4j...\n",
      "285 documents saved.\n",
      "Start saving nodes to Neo4j...\n",
      "389 nodes saved.\n",
      "Start saving objects to Neo4j...\n",
      "Start creating chunks for each TEXT Section...\n",
      "113 objects saved.\n",
      "=================DONE====================\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(NEO4J_URL, database=NEO4J_DATABASE, auth=(NEO4J_USER, NEO4J_PASSWORD))\n",
    "\n",
    "# ================================================\n",
    "# 1) Save documents\n",
    "\n",
    "print(\"Start saving documents to Neo4j...\")\n",
    "i = 0\n",
    "with driver.session() as session:\n",
    "    for doc in documents:\n",
    "        cypher = \"MERGE (d:Document {url_hash: $doc_id}) ON CREATE SET d.url=$url;\"\n",
    "        session.run(cypher, doc_id=doc.doc_id, url=doc.doc_id)\n",
    "        i = i + 1\n",
    "    session.close()\n",
    "\n",
    "print(f\"{i} documents saved.\")\n",
    "\n",
    "# ================================================\n",
    "# 2) Save nodes\n",
    "\n",
    "print(\"Start saving nodes to Neo4j...\")\n",
    "\n",
    "i = 0\n",
    "with driver.session() as session:\n",
    "    for node in base_nodes: \n",
    "\n",
    "        # >>1 Create Section node\n",
    "        cypher  = \"MERGE (c:Section {key: $node_id})\\n\"\n",
    "        cypher += \" FOREACH (ignoreMe IN CASE WHEN c.type IS NULL THEN [1] ELSE [] END |\\n\"\n",
    "        cypher += \"     SET c.hash = $hash, c.text=$content, c.type=$type, c.class=$class_name, c.start_idx=$start_idx, c.end_idx=$end_idx )\\n\"\n",
    "        cypher += \" WITH c\\n\"\n",
    "        cypher += \" MATCH (d:Document {url_hash: $doc_id})\\n\"\n",
    "        cypher += \" MERGE (d)<-[:HAS_DOCUMENT]-(c);\"\n",
    "\n",
    "        node_json = json.loads(node.json())\n",
    "\n",
    "        session.run(cypher, node_id=node.node_id, hash=node.hash, content=node.get_content(), type='TEXT', class_name=node.class_name()\n",
    "                          , start_idx=node_json['start_char_idx'], end_idx=node_json['end_char_idx'], doc_id=node.ref_doc_id)\n",
    "\n",
    "        # >>2 Link node using NEXT relationship\n",
    "\n",
    "        if node.next_node is not None: # and node.next_node.node_id[-1*len(TABLE_REF_SUFFIX):] != TABLE_REF_SUFFIX:\n",
    "            cypher  = \"MATCH (c:Section {key: $node_id})\\n\"    # current node should exist\n",
    "            cypher += \"MERGE (p:Section {key: $next_id})\\n\"    # previous node may not exist\n",
    "            cypher += \"MERGE (p)<-[:NEXT]-(c);\"\n",
    "\n",
    "            session.run(cypher, node_id=node.node_id, next_id=node.next_node.node_id)\n",
    "\n",
    "        if node.prev_node is not None:  # Because tables are in objects list, so we need to link from the opposite direction\n",
    "            cypher  = \"MATCH (c:Section {key: $node_id})\\n\"    # current node should exist\n",
    "            cypher += \"MERGE (p:Section {key: $prev_id})\\n\"    # previous node may not exist\n",
    "            cypher += \"MERGE (p)-[:NEXT]->(c);\"\n",
    "\n",
    "            if node.prev_node.node_id[-1 * len(TABLE_ID_SUFFIX):] == TABLE_ID_SUFFIX:\n",
    "                prev_id = node.prev_node.node_id + '_ref'\n",
    "            else:\n",
    "                prev_id = node.prev_node.node_id\n",
    "\n",
    "            session.run(cypher, node_id=node.node_id, prev_id=prev_id)\n",
    "\n",
    "        i = i + 1\n",
    "    session.close()\n",
    "\n",
    "print(f\"{i} nodes saved.\")\n",
    "\n",
    "# ================================================\n",
    "# 3) Save objects\n",
    "\n",
    "print(\"Start saving objects to Neo4j...\")\n",
    "\n",
    "i = 0\n",
    "with driver.session() as session:\n",
    "    for node in objects:               \n",
    "        node_json = json.loads(node.json())\n",
    "\n",
    "        # Object is a Table, then the ????_ref_table object is created as a Section, and the table object is Chunk\n",
    "        if node.node_id[-1 * len(TABLE_REF_SUFFIX):] == TABLE_REF_SUFFIX:\n",
    "            if node.next_node is not None:  # here is where actual table object is loaded\n",
    "                next_node = node.next_node\n",
    "\n",
    "                obj_metadata = json.loads(str(next_node.json()))\n",
    "\n",
    "                cypher  = \"MERGE (s:Section {key: $node_id})\\n\"\n",
    "                cypher += \"WITH s MERGE (c:Chunk {key: $table_id})\\n\"\n",
    "                cypher += \" FOREACH (ignoreMe IN CASE WHEN c.type IS NULL THEN [1] ELSE [] END |\\n\"\n",
    "                cypher += \"     SET c.hash = $hash, c.definition=$content, c.text=$table_summary, c.type=$type, c.start_idx=$start_idx, c.end_idx=$end_idx )\\n\"\n",
    "                cypher += \" WITH s, c\\n\"\n",
    "                cypher += \" MERGE (s) <-[:UNDER_SECTION]- (c)\\n\"\n",
    "                cypher += \" WITH s MATCH (d:Document {url_hash: $doc_id})\\n\"\n",
    "                cypher += \" MERGE (d)<-[:HAS_DOCUMENT]-(s);\"\n",
    "\n",
    "                session.run(cypher, node_id=node.node_id, hash=next_node.hash, content=obj_metadata['metadata']['table_df'], type='TABLE'\n",
    "                                  , start_idx=node_json['start_char_idx'], end_idx=node_json['end_char_idx']\n",
    "                                  , doc_id=node.ref_doc_id, table_summary=obj_metadata['metadata']['table_summary'], table_id=next_node.node_id)\n",
    "                \n",
    "            if node.prev_node is not None:\n",
    "                cypher  = \"MATCH (c:Section {key: $node_id})\\n\"    # current node should exist\n",
    "                cypher += \"MERGE (p:Section {key: $prev_id})\\n\"    # previous node may not exist\n",
    "                cypher += \"MERGE (p)-[:NEXT]->(c);\"\n",
    "\n",
    "                if node.prev_node.node_id[-1 * len(TABLE_ID_SUFFIX):] == TABLE_ID_SUFFIX:\n",
    "                    prev_id = node.prev_node.node_id + '_ref'\n",
    "                else:\n",
    "                    prev_id = node.prev_node.node_id\n",
    "                \n",
    "                session.run(cypher, node_id=node.node_id, prev_id=prev_id)\n",
    "                \n",
    "        i = i + 1\n",
    "    session.close()\n",
    "\n",
    "# ================================================\n",
    "# 4) Create Chunks for each Section object of type TEXT\n",
    "# If there are changes to the content of TEXT section, the Section node needs to be recreated\n",
    "\n",
    "print(\"Start creating chunks for each TEXT Section...\")\n",
    "\n",
    "with driver.session() as session:\n",
    "\n",
    "    cypher  = \"MATCH (s:Section) WHERE s.type='TEXT' \\n\"\n",
    "    cypher += \"WITH s CALL {\\n\"\n",
    "    cypher += \"WITH s WITH s, split(s.text, '\\n') AS para\\n\"\n",
    "    cypher += \"WITH s, para, range(0, size(para)-1) AS iterator\\n\"\n",
    "    cypher += \"UNWIND iterator AS i WITH s, trim(para[i]) AS chunk, i WHERE size(chunk) > 0\\n\"\n",
    "    cypher += \"MERGE (c:Chunk {key: s.key + '_' + i}) SET c.type='TEXT', c.text = chunk, c.seq = i \\n\"\n",
    "    cypher += \"MERGE (s) <-[:UNDER_SECTION]-(c) } IN TRANSACTIONS OF 500 ROWS ;\"\n",
    "    \n",
    "    session.run(cypher)\n",
    "    \n",
    "    session.close()\n",
    "\n",
    "\n",
    "print(f\"{i} objects saved.\")\n",
    "\n",
    "print(\"=================DONE====================\")\n",
    "\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "from openai import OpenAI\n",
    "import os\n",
    "NEO4J_URL = \"bolt://localhost:7687\"\n",
    "NEO4J_USER = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"m0del2_pass\"\n",
    "NEO4J_DATABASE = \"neo4j\"\n",
    "\n",
    "def get_embedding(client, text, model):\n",
    "    response = client.embeddings.create(\n",
    "                    input=text,\n",
    "                    model=model,\n",
    "                )\n",
    "    return response.data[0].embedding\n",
    "\n",
    "def LoadEmbedding(label, property):\n",
    "    driver = GraphDatabase.driver(NEO4J_URL, auth=(NEO4J_USER, NEO4J_PASSWORD), database=NEO4J_DATABASE)\n",
    "    openai_client = OpenAI (api_key = key)\n",
    "\n",
    "    with driver.session() as session:\n",
    "        # get chunks in document, together with their section titles\n",
    "        result = session.run(f\"MATCH (ch:{label}) RETURN id(ch) AS id, ch.{property} AS text\")\n",
    "        # call OpenAI embedding API to generate embeddings for each proporty of node\n",
    "        # for each node, update the embedding property\n",
    "        count = 0\n",
    "        for record in result:\n",
    "            id = record[\"id\"]\n",
    "            text = record[\"text\"]\n",
    "            \n",
    "            # For better performance, text can be batched\n",
    "            embedding = get_embedding(openai_client, text, EMBEDDING_MODEL)\n",
    "            \n",
    "            # key property of Embedding node differentiates different embeddings\n",
    "            cypher = \"CREATE (e:Embedding) SET e.key=$key, e.value=$embedding, e.model=$model\"\n",
    "            cypher = cypher + \" WITH e MATCH (n) WHERE id(n) = $id CREATE (n) -[:HAS_EMBEDDING]-> (e)\"\n",
    "            session.run(cypher,key=property, embedding=embedding, id=id, model=EMBEDDING_MODEL) \n",
    "            count = count + 1\n",
    "\n",
    "        session.close()\n",
    "        \n",
    "        print(\"Processed \" + str(count) + \" \" + label + \" nodes for property @\" + property + \".\")\n",
    "        return count"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Please note that the creation of embeddings may take up to an hour__\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "EMBEDDING_MODEL  = \"text-embedding-ada-002\"\n",
    "# LoadEmbedding(\"Chunk\", \"text\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now the knowledge graph has been created, we do not need to run the code anymore."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Retrieval\n",
    "We will now create the embeddings if they do not already exist<br>\n",
    "Then we will traverse the knowledge graph to generate context"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from langchain.vectorstores.neo4j_vector import Neo4jVector\n",
    "from langchain.embeddings.openai import OpenAIEmbeddings\n",
    "import openai\n",
    "openai.api_key = key\n",
    "os.environ[\"OPENAI_API_KEY\"]=key\n",
    "database_pass = os.environ[\"model_2_pass\"]\n",
    "\n",
    "# We now need to create an a vector index in Neo4j. This is essentially like a vector database.\n",
    "# Once created we can run the following code to access it. I have named mine index_1.\n",
    "vector_index = Neo4jVector.from_existing_graph(\n",
    "    OpenAIEmbeddings(),\n",
    "    url=\"bolt://localhost:7687\",\n",
    "    username=\"neo4j\",\n",
    "    password=database_pass,\n",
    "    database=\"neo4j\",\n",
    "    index_name='index_1',\n",
    "    node_label=\"Chunk\",\n",
    "    text_node_properties=['key'],\n",
    "    embedding_node_property='embedding',\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "key: f64b792f-a77d-4cde-8e4d-4ed2aa2fa12c_10\n",
      "[Document(metadata={'text': 'or being omitted from the risk engines.', 'seq': 12, 'type': 'TEXT'}, page_content='\\nkey: f64b792f-a77d-4cde-8e4d-4ed2aa2fa12c_12'), Document(metadata={'text': 'Monitoring RNIME', 'seq': 20, 'type': 'TEXT'}, page_content='\\nkey: f64b792f-a77d-4cde-8e4d-4ed2aa2fa12c_20'), Document(metadata={'text': 'This is a draft Instrument to accompany CP16/22 ‘Implementation of the Basel 3.1 standards’.', 'seq': 0, 'type': 'TEXT'}, page_content='\\nkey: f78b3d28-81a5-4d80-a1e5-21d2e848f559_0'), Document(metadata={'text': 'Other Factors Leading to Risks Not Being Captured Accurately', 'seq': 10, 'type': 'TEXT'}, page_content='\\nkey: f64b792f-a77d-4cde-8e4d-4ed2aa2fa12c_10')]\n"
     ]
    }
   ],
   "source": [
    "response = vector_index.similarity_search(\n",
    "    \"The institution shall calculate the fully adjusted value of the exposure\"\n",
    ")\n",
    "print(response[3].page_content)\n",
    "print(response)\n",
    "\n",
    "#This just demonstrates that the knowledge index can be accessed. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\GeorgeChant\\AppData\\Local\\Temp\\ipykernel_17032\\2251136242.py:23: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  result = session.read_transaction(find_connected_nodes, initial_node_id)\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 4, column: 25, offset: 91} for query: '\\n        MATCH (n)-[r]->(m)\\n        WHERE n.key = $initial_node_id\\n        RETURN n, r, m, id(m)\\n        '\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Connect to Neo4j\n",
    "uri = \"bolt://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"m0del2_pass\"\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "# Define the function to find connected nodes\n",
    "def find_connected_nodes(tx, initial_node_id):\n",
    "    query = (\n",
    "        \"\"\"\n",
    "        MATCH (n)-[r]->(m)\n",
    "        WHERE n.key = $initial_node_id\n",
    "        RETURN n, r, m\n",
    "        \"\"\"\n",
    "    ) # This runs a cypher query that allows for us to retrieved all connected nodes to our 'initial node'\n",
    "    result = tx.run(query, initial_node_id=initial_node_id)\n",
    "    return [(record[\"n\"], record[\"r\"], record[\"m\"]) for record in result] #returns relevant information\n",
    "\n",
    "def get_connected_nodes(initial_node_id):\n",
    "    with driver.session() as session:\n",
    "        result = session.execute_read(find_connected_nodes, initial_node_id)\n",
    "        return result\n",
    "\n",
    "## Example retrieval:\n",
    "# Fetch connected nodes for the initial node\n",
    "initial_node_id = \"e18d8566-ced0-4f03-afe1-07b1a7e45b84_2\"  # Replace with your actual node ID\n",
    "connected_nodes = get_connected_nodes(initial_node_id)\n",
    "\n",
    "#Fetch context from connected node\n",
    "def generate_context(connected_nodes):\n",
    "    for n, r, m in connected_nodes:\n",
    "        if m['text'] != 'None' and r.type == 'UNDER_SECTION':\n",
    "            #print(\"Context found:\",m['text'])\n",
    "            return m['text']\n",
    "\n",
    "# generate_context(connected_nodes)\n",
    "\n",
    "# Don't forget to close the driver connection when done\n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Generating our response from full context"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\GeorgeChant\\AppData\\Local\\Temp\\ipykernel_17032\\2251136242.py:22: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n",
      "C:\\Users\\GeorgeChant\\AppData\\Local\\Temp\\ipykernel_17032\\2251136242.py:23: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  result = session.read_transaction(find_connected_nodes, initial_node_id)\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 4, column: 25, offset: 91} for query: '\\n        MATCH (n)-[r]->(m)\\n        WHERE n.key = $initial_node_id\\n        RETURN n, r, m, id(m)\\n        '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 4, column: 25, offset: 91} for query: '\\n        MATCH (n)-[r]->(m)\\n        WHERE n.key = $initial_node_id\\n        RETURN n, r, m, id(m)\\n        '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 4, column: 25, offset: 91} for query: '\\n        MATCH (n)-[r]->(m)\\n        WHERE n.key = $initial_node_id\\n        RETURN n, r, m, id(m)\\n        '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated function: `id`.} {position: line: 4, column: 25, offset: 91} for query: '\\n        MATCH (n)-[r]->(m)\\n        WHERE n.key = $initial_node_id\\n        RETURN n, r, m, id(m)\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "page_content='Bank of England\n",
      "\n",
      "Page 119\n",
      "\n",
      "changes to the IRB framework that would need to be in place by the PRA’s proposed\n",
      "implementation date (see Chapter 1 – Overview);\n",
      "\n",
      "measures that would need to be in place where firms’ IRB models are not fully compliant\n",
      "by the PRA’s proposed implementation date; and\n",
      "\n",
      "timescales for IRB model submissions.\n",
      "\n",
      " Changes required by the PRA’s proposed implementation date\n",
      "\n",
      "4.17 The PRA proposes that firms implement non-modelling related changes and input floors\n",
      "to model parameters by the PRA’s proposed implementation date of 1 January 2025. The\n",
      "following changes would apply from this date:\n",
      "\n",
      "all restrictions on the scope of IRB models (eg restrictions on modelling EAD and mandatory use of the SA or FIRB approach, subject to the transitional arrangements for equity exposures);all changes to LGD and EAD under the FIRB approach and all changes to the maturity calculation; andall IRB input floors.\n",
      "\n",
      "4.18 The PRA notes that the above non-modelling related changes would not need to be\n",
      "notified to the PRA under its notifications and approvals framework.\n",
      "\n",
      "4.19 Firms’ existing IRB permissions were issued under the CRR. The PRA expects these\n",
      "permissions to be saved by HMT to avoid firms needing to re-apply for existing permissions.\n",
      "The PRA would then vary these permissions using its powers under section 144G of the\n",
      "Financial Services and Markets Act 2000 (FSMA) where necessary such that the saved\n",
      "permissions would operate in line with the proposals set out in paragraph 4.17 from 1\n",
      "January 2025.\n",
      "\n",
      "4.20 The PRA considers that these changes would improve the robustness of modelled risk\n",
      "weights and their timely implementation would promote the safety and soundness of firms\n",
      "and improve competition between SA and IRB firms.\n",
      "\n",
      " Requirements where firms are not fully compliant by the PRA’s proposed\n",
      "implementation date\n",
      "\n",
      "4.21 In contrast to the non-modelling changes, the PRA does not propose to require that the\n",
      "IRB models themselves be fully compliant at the proposed implementation date provided\n",
      "that:\n",
      "\n",
      "firms have an appropriate remediation plan in place that has been agreed with the PRA,\n",
      "including an appropriate date for the implementation of their new models, or demonstrate'\n",
      "This question is outside my dataset. Please try again or see 'help' for advice on how to structure a question efficiently.\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"This question is outside my dataset. Please try again or see 'help' for advice on how to structure a question efficiently.\""
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_openai import AzureChatOpenAI\n",
    "import openai\n",
    "from langchain.prompts import ChatPromptTemplate\n",
    "from langchain.docstore.document import Document\n",
    "\n",
    "# Function to generate response\n",
    "def generate_response1(question, vector_index):\n",
    "    # Initialize the AzureChatOpenAI instance\n",
    "    llm = AzureChatOpenAI(\n",
    "        azure_deployment=\"gpt-4o-gs-v1\",\n",
    "        azure_endpoint=os.getenv(\"AZURE_OPENAI_ENDPOINT\"),\n",
    "        openai_api_key=os.getenv(\"AZURE_OPENAI_API_KEY\"),\n",
    "        api_version=\"2023-05-15\",\n",
    "        verbose=False,\n",
    "        temperature=0,\n",
    "    )\n",
    " \n",
    "    # Create a prompt template\n",
    "    template = \"\"\"\n",
    "    You are a regulatory assistant called Reggie, answer the question based on the documents provided. If you can't answer\n",
    "    the question, reply \"This question is outside my dataset. Please try again or see 'help' for advice on how to structure a question efficiently.\".\n",
    "        \n",
    "    Context: {context}\n",
    "\n",
    "    Question: {question}\n",
    "    \"\"\"\n",
    "    prompt_template = ChatPromptTemplate.from_template(template)\n",
    "\n",
    "    # Define the context generator function\n",
    "    def context_generator(question):\n",
    "        response_key = vector_index.similarity_search(question) #Uses similarity search to return the nearest embedding's Neo4j key. Returns 4 keys by default.\n",
    "        list_of_keys = []\n",
    "        context_document = []\n",
    "        for i in range(0, len(response_key)):\n",
    "            new_response_key = response_key[i].page_content\n",
    "            list_of_keys.append(new_response_key[6:]) #removes the word 'key:  ' from the start of each key.\n",
    "        #print(list_of_keys)\n",
    "\n",
    "        for i in range(0, len(list_of_keys)):\n",
    "            initial_node_id = list_of_keys[i]\n",
    "            connected_nodes = get_connected_nodes(initial_node_id) #Retrieves the text from the Section linked to each chunk. (This provides full context for that chunk)\n",
    "            context_document.append(Document(page_content =generate_context(connected_nodes) )) # Then adds all of the context into a list ## need to add meta data as well??\n",
    "        print(context_document[3])\n",
    "        #Need to ensure each document is unique:\n",
    "        unique_documents = []\n",
    "        seen_ids = set()\n",
    "        for doc in context_document:\n",
    "            if doc.id not in seen_ids:\n",
    "                unique_documents.append(doc)\n",
    "                seen_ids.add(doc.id)\n",
    "\n",
    "        return unique_documents\n",
    "\n",
    "    context_document = context_generator(question)\n",
    "    # Format the documents\n",
    "    def format_docs(docs):\n",
    "        return \"\\n\\n\".join(doc.page_content for doc in docs)\n",
    "\n",
    "    # Generate context and format the prompt\n",
    "    context_text = format_docs(context_document)\n",
    "\n",
    "    formatted_prompt = prompt_template.format(context=context_text, question=question) # Adds context to prompt\n",
    "    #print(formatted_prompt)\n",
    "    \n",
    "    # Create the RAG response\n",
    "    response = llm.invoke(formatted_prompt) \n",
    "    print(response.content)\n",
    "    \n",
    "    return response.content\n",
    "\n",
    "generate_response1(\"what is VaR?\",vector_index)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "RAG_model_1",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
